
# üìä LEVEL 3 ‚Äî ADVANCED BUSINESS INSIGHTS

In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
engine = create_engine('mysql+pymysql://root:password@127.0.0.1/crm_sales')

### 1. Find the top 3 sales agents by total close_value from Won deals.

In [53]:
query = f"""select sales_agent,deal_stage,sum(close_value) as Total_vales from sales_pipeline WHERE deal_stage = 'Won' group by sales_agent order by Total_vales desc limit 3;"""
table_data = pd.read_sql(query, engine)
display(table_data)

       sales_agent deal_stage  Total_vales
0  Darcel Schlecht        Won    1153214.0
1   Vicki Laflamme        Won     478396.0
2  Kary Hendrixson        Won     454298.0

### 2. Calculate each agent‚Äôs success rate = (Number of Won deals / Total deals) * 100.

In [83]:
query = f"""SELECT 
    sales_agent,
    sum(deal_stage = 'Won') AS won_total_deals,
    COUNT(*) AS total_deals,
    (sum(deal_stage = 'Won') /COUNT(*))*100 as success_rate
    
FROM 
    sales_pipeline
GROUP BY 
    sales_agent;"""
table_data = pd.read_sql(query,engine)
display(table_data)

           sales_agent  won_total_deals  total_deals  success_rate
0          Moses Frase            129.0          195       66.1538
1      Darcel Schlecht            349.0          553       63.1103
2            Zane Levy            161.0          261       61.6858
3        Anna Snelling            208.0          336       61.9048
4       Vicki Laflamme            221.0          347       63.6888
5       Markita Hansen            130.0          227       57.2687
6      Niesha Huffines            105.0          175       60.0000
7     Gladys Colclough            135.0          232       58.1897
8       James Ascencio            135.0          206       65.5340
9      Maureen Marcano            149.0          213       69.9531
10       Hayden Neloms            107.0          152       70.3947
11     Rosalina Dieter             72.0          110       65.4545
12   Versie Hillebrand            176.0          264       66.6667
13     Daniell Hammack            114.0          187       60.9626
14        Elease Gluck             80.0          126       63.4921
15    Violet Mclelland            122.0          193       63.2124
16       Kami Bicknell            174.0          272       63.9706
17  Rosie Papadopoulos             78.0          121       64.4628
18     Kary Hendrixson            209.0          335       62.3881
19        Reed Clapper            155.0          237       65.4008
20      Wilburn Farren             55.0           79       69.6203
21       Garret Kinder             75.0          123       60.9756
22   Marty Freudenburg            122.0          194       62.8866
23     Lajuana Vencill            127.0          231       54.9784
24           Boris Faz            101.0          153       66.0131
25       Donn Cantrell            158.0          275       57.4545
26       Corliss Cosme            150.0          229       65.5022
27        Cassey Cress            163.0          261       62.4521
28      Cecily Lampkin            107.0          160       66.8750
29  Jonathan Berthelot            171.0          264       64.7727

### 3. Find the average deal size for each product.

In [92]:
query = f"""SELECT product,avg(close_value) as Avg_deal_size from sales_pipeline group by product;"""
table_data = pd.read_sql(query,engine)
display(table_data)

          product  Avg_deal_size
0  GTX Plus Basic       671.0514
1          GTXPro      3060.6609
2      MG Special        35.7874
3       GTX Basic       347.6762
4    GTX Plus Pro      3529.7329
5     MG Advanced      2044.6375
6         GTK 500     16024.4800

### 4. Identify which sector contributes the most total revenue .

In [107]:
query = f"""SELECT sector,sum(revenue) as Total_revenue from accounts group by sector order by  Total_revenue desc limit 1;"""
table_data = pd.read_sql(query,engine)
display(table_data)

     sector  Total_revenue
0  software       30950.45

### 5. Determine which company has won the most deals.

In [113]:
query = f"""SELECT account,count(deal_stage) as most_won_deals from sales_pipeline where deal_stage = 'Won' group by account order by most_won_deals desc limit 1 ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

    account  most_won_deals
0  Kan-code             115

### 6. Calculate the average sales cycle duration in days (difference between engage_date and close_date).

In [121]:
query = f"""SELECT (engage_date),close_date,close_date-engage_date from sales_pipeline;"""
table_data = pd.read_sql(query,engine)
display(table_data)

     engage_date  close_date  close_date-engage_date
0     2016-10-20  2017-03-01                     1.0
1     2016-10-25  2017-03-11                     1.0
2     2016-10-25  2017-03-07                     1.0
3     2016-10-25  2017-03-09                     1.0
4     2016-10-25  2017-03-02                     1.0
...          ...         ...                     ...
6706  2017-12-24  2017-12-26                     0.0
6707  2017-12-24  2017-12-30                     0.0
6708  2017-12-26  2017-12-29                     0.0
6709  2017-12-27  2017-12-30                     0.0
6710  2017-12-27  2017-12-29                     0.0

[6711 rows x 3 columns]

### 7. Find the month in which most deals were closed.

In [134]:
query = f"""SELECT MONTHNAME(close_date) as Months,count(MONTHNAME(close_date)) as Month_counts from sales_pipeline group by MONTHNAME(close_date) order by Month_counts desc limit 1;"""
table_data = pd.read_sql(query,engine)
display(table_data)

  Months  Month_counts
0    May           805

### 8. Display the top-performing region (Central, East, West) based on Won deals‚Äô close_value.

In [154]:
query = f"""SELECT st.regional_office,sum(sp.close_value) as Total_Won_close_value from sales_teams as st join sales_pipeline as sp on st.sales_agent = sp.sales_agent where sp.deal_stage = "Won"   group by st.regional_office order by Total_Won_close_value desc limit 1 ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

  regional_office  Total_Won_close_value
0            West              3568647.0

### 9. Show total revenue per manager .

In [176]:
query = f"""select st.manager,sum(ac.revenue) as Total_revenue from accounts as ac join sales_pipeline as sp on ac.account = sp.account join sales_teams as st  on sp.sales_agent =st.sales_agent group by st.manager ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

            manager  Total_revenue
0  Dustin Brinkmann     2407244.85
1     Melvin Marxen     2910722.60
2     Summer Sewald     3914591.47
3      Celia Rouche     2841363.10
4     Rocco Neubert     2876976.69
5        Cara Losch     1962248.77

### 10. List all deals where the product series is ‚ÄúGTX‚Äù and status is ‚ÄúWon‚Äù.

In [180]:
query = f"""SELECT * from products as p join sales_pipeline as sp on p.product = sp.product where p.series = "GTX" and sp.deal_stage = "Won" ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

,product,series,sales_price,opportunity_id,sales_agent,product,account,deal_stage,engage_date,close_date,close_value
0,GTX Plus Basic,GTX,1096,1C1I7A6R,Moses Frase,GTX Plus Basic,Cancity,Won,2016-10-20,2017-03-01,1054
1,GTX Basic,GTX,550,MV1LWRNH,Moses Frase,GTX Basic,Codehow,Won,2016-10-25,2017-03-09,588
2,GTX Basic,GTX,550,PE84CX4O,Zane Levy,GTX Basic,Hatfan,Won,2016-10-25,2017-03-02,517
3,GTX Basic,GTX,550,7GN8Q4LL,Markita Hansen,GTX Basic,Cheers,Won,2016-11-01,2017-03-07,601
4,GTX Plus Basic,GTX,1096,OLK9LKZB,Niesha Huffines,GTX Plus Basic,Zumgoity,Won,2016-11-01,2017-03-03,1026
...,...,...,...,...,...,...,...,...,...,...,...
2042,GTX Basic,GTX,550,3MXS2HRE,Cassey Cress,GTX Basic,Ganjaflex,Won,2017-12-23,2017-12-31,576
2043,GTX Basic,GTX,550,1YBATFAY,James Ascencio,GTX Basic,Singletechno,Won,2017-12-24,2017-12-26,538
2044,GTX Basic,GTX,550,2EBLR9N8,Lajuana Vencill,GTX Basic,Conecom,Won,2017-12-24,2017-12-26,622
2045,GTX Plus Basic,GTX,1096,VDGA4KXA,Violet Mclelland,GTX Plus Basic,Bluth Company,Won,2017-12-24,2017-12-30,1093
2046,GTX Plus Basic,GTX,1096,YJTQSZ9D,Gladys Colclough,GTX Plus Basic,Inity,Won,2017-12-27,2017-12-30,1052